Goal: to train my skills gained during Python course at Data Science studies.
Program version: Jupyter Notebook 7.2.2 
Data library : SASHELP/FISH – has 159 observations of fish, columns are named: Species, Weight, Length 1, Length 2, Length 3, Height, Width

Task 0
Import a dataset fish.sas7bdat to pandas dataframe.

In [166]:
import pandas as pd
df = pd.read_sas("fish.sas7bdat", encoding="utf-8")
df.info()
df.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Species  159 non-null    object
 1   Weight   158 non-null    float64
 2   Length1  159 non-null    float64
 3   Length2  159 non-null    float64
 4   Length3  159 non-null    float64
 5   Height   159 non-null    float64
 6   Width    159 non-null    float64
dtypes: float64(6), object(1)
memory usage: 8.8+ KB

  Species  Weight  Length1  Length2  Length3   Height   Width
0   Bream   242.0     23.2     25.4     30.0  11.5200  4.0200
1   Bream   290.0     24.0     26.3     31.2  12.4800  4.3056
2   Bream   340.0     23.9     26.5     31.1  12.3778  4.6961

In [168]:
df[df["Weight"]<1]

   Species  Weight  Length1  Length2  Length3  Height   Width
40   Roach     0.0     19.0     20.5     22.8  6.4752  3.3516

In [170]:
df.iloc[[10,40,80,110,130,150]]

    Species  Weight  Length1  Length2  Length3   Height   Width
10    Bream   475.0     28.4     31.0     36.2  14.2628  5.1042
40    Roach     0.0     19.0     20.5     22.8   6.4752  3.3516
80    Perch    85.0     17.8     19.6     20.8   5.1376  3.0368
110   Perch   556.0     32.0     34.5     36.5  10.2565  6.3875
130    Pike   300.0     32.7     35.0     38.8   5.9364  4.3844
150   Smelt     8.7     10.8     11.3     12.6   1.9782  1.2852

Task 1
Calculate average length. Set as a new column Legth. Delete other length columns.

In [172]:
df["LengthAvg"] = (df["Length1"]+df["Length2"]+df["Length3"])/3

In [174]:
df = df.drop("Length1", axis=1)
df = df.drop("Length2", axis=1)
df = df.drop("Length3", axis=1)
df.head()

  Species  Weight   Height   Width  LengthAvg
0   Bream   242.0  11.5200  4.0200  26.200000
1   Bream   290.0  12.4800  4.3056  27.166667
2   Bream   340.0  12.3778  4.6961  27.166667
3   Bream   363.0  12.7300  4.4555  29.600000
4   Bream   430.0  12.4440  5.1340  29.833333

Task 2 
Calculate average weight for each type of fish. Sort them in decreasing order. Present only 50 the heaviest fish.

In [176]:
df_grouped = df.groupby("Species")
df_grouped["Weight"].describe()

,count,mean,std,min,25%,50%,75%,max
Species,,,,,,,,
Bream,34.0,626.000000,206.604585,242.0,481.25,615.00,718.50,1000.0
Parkki,11.0,154.818182,78.755086,55.0,105.00,145.00,185.00,300.0
Perch,56.0,382.239286,347.617717,5.9,120.00,207.50,692.50,1100.0
Pike,17.0,718.705882,494.140765,200.0,345.00,510.00,950.00,1650.0
Roach,20.0,152.050000,88.828916,0.0,104.25,147.50,171.75,390.0
Smelt,14.0,11.178571,4.131526,6.7,8.95,9.85,12.20,19.9
Whitefish,6.0,531.000000,309.602972,270.0,279.00,423.00,735.00,1000.0

In [178]:
df_sorted = df.sort_values(by="Weight", ascending=False)
df_50heaviest = df_sorted[0:50]
df_50heaviest.info()
df_50heaviest.head()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 144 to 58
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Species    50 non-null     object
 1   Weight     50 non-null     float64
 2   Height     50 non-null     float64
 3   Width      50 non-null     float64
 4   LengthAvg  50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.3+ KB

    Species  Weight   Height   Width  LengthAvg
144    Pike  1650.0  10.8120  7.4800  63.466667
142    Pike  1600.0   9.6000  6.1440  60.000000
143    Pike  1550.0   9.6000  6.1440  60.000000
141    Pike  1250.0  10.6863  6.9849  55.900000
123   Perch  1100.0  12.8002  6.8684  41.866667

Task 3 
Perform rounding of height and width with precision to decimals.

In [180]:
def roundDecimals(value):
    return round(value, 1)

df["Height"] = df["Height"].apply(roundDecimals)
df["Width"] = df["Width"].apply(roundDecimals)
df.head()

  Species  Weight  Height  Width  LengthAvg
0   Bream   242.0    11.5    4.0  26.200000
1   Bream   290.0    12.5    4.3  27.166667
2   Bream   340.0    12.4    4.7  27.166667
3   Bream   363.0    12.7    4.5  29.600000
4   Bream   430.0    12.4    5.1  29.833333

Task 4	
Add a new column which has three first letters of the name of each fish.

In [182]:
def speciesCut(name):
    return name[0:3].upper()
    
df["Letters"] = df["Species"].apply(speciesCut)
df.head()

  Species  Weight  Height  Width  LengthAvg Letters
0   Bream   242.0    11.5    4.0  26.200000     BRE
1   Bream   290.0    12.5    4.3  27.166667     BRE
2   Bream   340.0    12.4    4.7  27.166667     BRE
3   Bream   363.0    12.7    4.5  29.600000     BRE
4   Bream   430.0    12.4    5.1  29.833333     BRE

Task 5
Add a new column which has a random normal number from 1 to 12 assigned to each observation.
Combine the column from task 4 and task 5 in order to create a new column Code in a form of “3SME”. 
Count how many observations will have “5BRE” code.

In [238]:
import numpy as np

numberList = []
for i in range(len(df)):
    numberList.append(np.random.randint(1, 13))

codeList = []
for label, row in df.iterrows():
    codeList.append(str(numberList[label])+df.loc[label,"Letters"])

df["Code"] = codeList
df.head()

  Species  Weight  Height  Width  LengthAvg Letters   Code
0   Bream   242.0    11.5    4.0  26.200000     BRE   9BRE
1   Bream   290.0    12.5    4.3  27.166667     BRE   4BRE
2   Bream   340.0    12.4    4.7  27.166667     BRE   9BRE
3   Bream   363.0    12.7    4.5  29.600000     BRE   8BRE
4   Bream   430.0    12.4    5.1  29.833333     BRE  12BRE

In [260]:
counter = 0
indexList = []

for i in range(len(df)):
    if df.loc[i,"Code"] == "5BRE":
        counter = counter + 1
        indexList.append(i)

print(counter)
df.iloc[indexList]

1

   Species  Weight  Height  Width  LengthAvg Letters  Code
27   Bream   714.0    16.5    5.9  36.733333     BRE  5BRE

Task 6
Read a new data table from txt file which contains fish name and geographic name according to the following scheme.
Smelt, Pacific Ocean
Pike, Lake Erie
Perch, Lake Balkhash
Whitefish, Atlantic Ocean
Parkki, Mediterranean Sea
Roach, Caspian Sea
Bream, Volga River

In [266]:
df_ocean = pd.read_csv("fish_ocean.txt", sep=",", header=None, names=["Species", "Ocean"])
df_ocean.head()

     Species               Ocean
0      Smelt       Pacific Ocean
1       Pike           Lake Erie
2      Perch       Lake Balkhash
3  Whitefish      Atlantic Ocean
4     Parkki   Mediterranean Sea

Task 7
Merge the new data table with existing fish file.

In [276]:
df_fish_ocean = pd.merge(df, df_ocean, on="Species")
df_fish_ocean.iloc[[10,40,80,110,130,150]]

    Species  Weight  Height  Width  LengthAvg Letters   Code           Ocean
10    Bream   475.0    14.3    5.1  31.866667     BRE   9BRE     Volga River
40    Roach     0.0     6.5    3.4  20.766667     ROA   6ROA     Caspian Sea
80    Perch    85.0     5.1    3.0  19.400000     PER  11PER   Lake Balkhash
110   Perch   556.0    10.3    6.4  34.333333     PER   8PER   Lake Balkhash
130    Pike   300.0     5.9    4.4  35.500000     PIK   6PIK       Lake Erie
150   Smelt     8.7     2.0    1.3  11.566667     SME   9SME   Pacific Ocean

Task 8
Save the complete fish table with 159 observations and new columns into an excel file.

In [278]:
df_fish_ocean.to_excel("output.xlsx")